espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_flash.h
/******************************************************************************
*  Filename:       hw_flash_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_FLASH_H__
#define __HW_FLASH_H__

//*****************************************************************************
//
// This section defines the register offsets of
// FLASH component
//
//*****************************************************************************
// FMC and Efuse Status
#define FLASH_O_STAT                                                0x0000001C

// Internal
#define FLASH_O_CFG                                                 0x00000024

// Internal
#define FLASH_O_FLASH_SIZE                                          0x0000002C

// Internal
#define FLASH_O_FWLOCK                                              0x0000003C

// Internal
#define FLASH_O_FWFLAG                                              0x00000040

// Internal
#define FLASH_O_EFUSE                                               0x00001000

// Internal
#define FLASH_O_EFUSEADDR                                           0x00001004

// Internal
#define FLASH_O_DATAUPPER                                           0x00001008

// Internal
#define FLASH_O_DATALOWER                                           0x0000100C

// Internal
#define FLASH_O_EFUSECFG                                            0x00001010

// Internal
#define FLASH_O_EFUSESTAT                                           0x00001014

// Internal
#define FLASH_O_ACC                                                 0x00001018

// Internal
#define FLASH_O_BOUNDARY                                            0x0000101C

// Internal
#define FLASH_O_EFUSEFLAG                                           0x00001020

// Internal
#define FLASH_O_EFUSEKEY                                            0x00001024

// Internal
#define FLASH_O_EFUSERELEASE                                        0x00001028

// Internal
#define FLASH_O_EFUSEPINS                                           0x0000102C

// Internal
#define FLASH_O_EFUSECRA                                            0x00001030

// Internal
#define FLASH_O_EFUSEREAD                                           0x00001034

// Internal
#define FLASH_O_EFUSEPROGRAM                                        0x00001038

// Internal
#define FLASH_O_EFUSEERROR                                          0x0000103C

// Internal
#define FLASH_O_SINGLEBIT                                           0x00001040

// Internal
#define FLASH_O_TWOBIT                                              0x00001044

// Internal
#define FLASH_O_SELFTESTCYC                                         0x00001048

// Internal
#define FLASH_O_SELFTESTSIGN                                        0x0000104C

// Internal
#define FLASH_O_FRDCTL                                              0x00002000

// Internal
#define FLASH_O_FSPRD                                               0x00002004

// Internal
#define FLASH_O_FEDACCTL1                                           0x00002008

// Internal
#define FLASH_O_FEDACSTAT                                           0x0000201C

// Internal
#define FLASH_O_FBPROT                                              0x00002030

// Internal
#define FLASH_O_FBSE                                                0x00002034

// Internal
#define FLASH_O_FBBUSY                                              0x00002038

// Internal
#define FLASH_O_FBAC                                                0x0000203C

// Internal
#define FLASH_O_FBFALLBACK                                          0x00002040

// Internal
#define FLASH_O_FBPRDY                                              0x00002044

// Internal
#define FLASH_O_FPAC1                                               0x00002048

// Internal
#define FLASH_O_FPAC2                                               0x0000204C

// Internal
#define FLASH_O_FMAC                                                0x00002050

// Internal
#define FLASH_O_FMSTAT                                              0x00002054

// Internal
#define FLASH_O_FLOCK                                               0x00002064

// Internal
#define FLASH_O_FVREADCT                                            0x00002080

// Internal
#define FLASH_O_FVHVCT1                                             0x00002084

// Internal
#define FLASH_O_FVHVCT2                                             0x00002088

// Internal
#define FLASH_O_FVHVCT3                                             0x0000208C

// Internal
#define FLASH_O_FVNVCT                                              0x00002090

// Internal
#define FLASH_O_FVSLP                                               0x00002094

// Internal
#define FLASH_O_FVWLCT                                              0x00002098

// Internal
#define FLASH_O_FEFUSECTL                                           0x0000209C

// Internal
#define FLASH_O_FEFUSESTAT                                          0x000020A0

// Internal
#define FLASH_O_FEFUSEDATA                                          0x000020A4

// Internal
#define FLASH_O_FSEQPMP                                             0x000020A8

// Internal
#define FLASH_O_FBSTROBES                                           0x00002100

// Internal
#define FLASH_O_FPSTROBES                                           0x00002104

// Internal
#define FLASH_O_FBMODE                                              0x00002108

// Internal
#define FLASH_O_FTCR                                                0x0000210C

// Internal
#define FLASH_O_FADDR                                               0x00002110

// Internal
#define FLASH_O_FTCTL                                               0x0000211C

// Internal
#define FLASH_O_FWPWRITE0                                           0x00002120

// Internal
#define FLASH_O_FWPWRITE1                                           0x00002124

// Internal
#define FLASH_O_FWPWRITE2                                           0x00002128

// Internal
#define FLASH_O_FWPWRITE3                                           0x0000212C

// Internal
#define FLASH_O_FWPWRITE4                                           0x00002130

// Internal
#define FLASH_O_FWPWRITE5                                           0x00002134

// Internal
#define FLASH_O_FWPWRITE6                                           0x00002138

// Internal
#define FLASH_O_FWPWRITE7                                           0x0000213C

// Internal
#define FLASH_O_FWPWRITE_ECC                                        0x00002140

// Internal
#define FLASH_O_FSWSTAT                                             0x00002144

// Internal
#define FLASH_O_FSM_GLBCTL                                          0x00002200

// Internal
#define FLASH_O_FSM_STATE                                           0x00002204

// Internal
#define FLASH_O_FSM_STAT                                            0x00002208

// Internal
#define FLASH_O_FSM_CMD                                             0x0000220C

// Internal
#define FLASH_O_FSM_PE_OSU                                          0x00002210

// Internal
#define FLASH_O_FSM_VSTAT                                           0x00002214

// Internal
#define FLASH_O_FSM_PE_VSU                                          0x00002218

// Internal
#define FLASH_O_FSM_CMP_VSU                                         0x0000221C

// Internal
#define FLASH_O_FSM_EX_VAL                                          0x00002220

// Internal
#define FLASH_O_FSM_RD_H                                            0x00002224

// Internal
#define FLASH_O_FSM_P_OH                                            0x00002228

// Internal
#define FLASH_O_FSM_ERA_OH                                          0x0000222C

// Internal
#define FLASH_O_FSM_SAV_PPUL                                        0x00002230

// Internal
#define FLASH_O_FSM_PE_VH                                           0x00002234

// Internal
#define FLASH_O_FSM_PRG_PW                                          0x00002240

// Internal
#define FLASH_O_FSM_ERA_PW                                          0x00002244

// Internal
#define FLASH_O_FSM_SAV_ERA_PUL                                     0x00002254

// Internal
#define FLASH_O_FSM_TIMER                                           0x00002258

// Internal
#define FLASH_O_FSM_MODE                                            0x0000225C

// Internal
#define FLASH_O_FSM_PGM                                             0x00002260

// Internal
#define FLASH_O_FSM_ERA                                             0x00002264

// Internal
#define FLASH_O_FSM_PRG_PUL                                         0x00002268

// Internal
#define FLASH_O_FSM_ERA_PUL                                         0x0000226C

// Internal
#define FLASH_O_FSM_STEP_SIZE                                       0x00002270

// Internal
#define FLASH_O_FSM_PUL_CNTR                                        0x00002274

// Internal
#define FLASH_O_FSM_EC_STEP_HEIGHT                                  0x00002278

// Internal
#define FLASH_O_FSM_ST_MACHINE                                      0x0000227C

// Internal
#define FLASH_O_FSM_FLES                                            0x00002280

// Internal
#define FLASH_O_FSM_WR_ENA                                          0x00002288

// Internal
#define FLASH_O_FSM_ACC_PP                                          0x0000228C

// Internal
#define FLASH_O_FSM_ACC_EP                                          0x00002290

// Internal
#define FLASH_O_FSM_ADDR                                            0x000022A0

// Internal
#define FLASH_O_FSM_SECTOR                                          0x000022A4

// Internal
#define FLASH_O_FMC_REV_ID                                          0x000022A8

// Internal
#define FLASH_O_FSM_ERR_ADDR                                        0x000022AC

// Internal
#define FLASH_O_FSM_PGM_MAXPUL                                      0x000022B0

// Internal
#define FLASH_O_FSM_EXECUTE                                         0x000022B4

// Internal
#define FLASH_O_FSM_SECTOR1                                         0x000022C0

// Internal
#define FLASH_O_FSM_SECTOR2                                         0x000022C4

// Internal
#define FLASH_O_FSM_BSLE0                                           0x000022E0

// Internal
#define FLASH_O_FSM_BSLE1                                           0x000022E4

// Internal
#define FLASH_O_FSM_BSLP0                                           0x000022F0

// Internal
#define FLASH_O_FSM_BSLP1                                           0x000022F4

// FMC FSM Enable 128-bit Wide Programming
#define FLASH_O_FSM_PGM128                                          0x000022F8

// FMC FSM Enable Parallell Reads for Multibanks
#define FLASH_O_FSM_EN_PRL_BNK_RD                                   0x000022FC

// Internal
#define FLASH_O_FCFG_BANK                                           0x00002400

// Internal
#define FLASH_O_FCFG_WRAPPER                                        0x00002404

// Internal
#define FLASH_O_FCFG_BNK_TYPE                                       0x00002408

// Internal
#define FLASH_O_FCFG_B0_START                                       0x00002410

// Internal
#define FLASH_O_FCFG_B1_START                                       0x00002414

// Internal
#define FLASH_O_FCFG_B2_START                                       0x00002418

// Internal
#define FLASH_O_FCFG_B3_START                                       0x0000241C

// Internal
#define FLASH_O_FCFG_B4_START                                       0x00002420

// Internal
#define FLASH_O_FCFG_B5_START                                       0x00002424

// Internal
#define FLASH_O_FCFG_B6_START                                       0x00002428

// Internal
#define FLASH_O_FCFG_B7_START                                       0x0000242C

// Internal
#define FLASH_O_FCFG_B0_SSIZE0                                      0x00002430

// Internal
#define FLASH_O_FCFG_B0_SSIZE1                                      0x00002434

// Internal
#define FLASH_O_FCFG_B0_SSIZE2                                      0x00002438

// Internal
#define FLASH_O_FCFG_B0_SSIZE3                                      0x0000243C

// Internal
#define FLASH_O_FCFG_B1_SSIZE0                                      0x00002440

// Internal
#define FLASH_O_FCFG_B1_SSIZE1                                      0x00002444

// Internal
#define FLASH_O_FCFG_B1_SSIZE2                                      0x00002448

// Internal
#define FLASH_O_FCFG_B1_SSIZE3                                      0x0000244C

// Internal
#define FLASH_O_FCFG_B2_SSIZE0                                      0x00002450

// Internal
#define FLASH_O_FCFG_B2_SSIZE1                                      0x00002454

// Internal
#define FLASH_O_FCFG_B2_SSIZE2                                      0x00002458

// Internal
#define FLASH_O_FCFG_B2_SSIZE3                                      0x0000245C

// Internal
#define FLASH_O_FCFG_B3_SSIZE0                                      0x00002460

// Internal
#define FLASH_O_FCFG_B3_SSIZE1                                      0x00002464

// Internal
#define FLASH_O_FCFG_B3_SSIZE2                                      0x00002468

// Internal
#define FLASH_O_FCFG_B3_SSIZE3                                      0x0000246C

// Internal
#define FLASH_O_FCFG_B4_SSIZE0                                      0x00002470

// Internal
#define FLASH_O_FCFG_B4_SSIZE1                                      0x00002474

// Internal
#define FLASH_O_FCFG_B4_SSIZE2                                      0x00002478

// Internal
#define FLASH_O_FCFG_B4_SSIZE3                                      0x0000247C

// Internal
#define FLASH_O_FCFG_B5_SSIZE0                                      0x00002480

// Internal
#define FLASH_O_FCFG_B5_SSIZE1                                      0x00002484

// Internal
#define FLASH_O_FCFG_B5_SSIZE2                                      0x00002488

// Internal
#define FLASH_O_FCFG_B5_SSIZE3                                      0x0000248C

// Internal
#define FLASH_O_FCFG_B6_SSIZE0                                      0x00002490

// Internal
#define FLASH_O_FCFG_B6_SSIZE1                                      0x00002494

// Internal
#define FLASH_O_FCFG_B6_SSIZE2                                      0x00002498

// Internal
#define FLASH_O_FCFG_B6_SSIZE3                                      0x0000249C

// Internal
#define FLASH_O_FCFG_B7_SSIZE0                                      0x000024A0

// Internal
#define FLASH_O_FCFG_B7_SSIZE1                                      0x000024A4

// Internal
#define FLASH_O_FCFG_B7_SSIZE2                                      0x000024A8

// Internal
#define FLASH_O_FCFG_B7_SSIZE3                                      0x000024AC

//*****************************************************************************
//
// Register: FLASH_O_STAT
//
//*****************************************************************************
// Field:    [15] EFUSE_BLANK
//
// Efuse scanning detected if fuse ROM is blank:
// 0 : Not blank
// 1 : Blank
#define FLASH_STAT_EFUSE_BLANK                                      0x00008000
#define FLASH_STAT_EFUSE_BLANK_BITN                                         15
#define FLASH_STAT_EFUSE_BLANK_M                                    0x00008000
#define FLASH_STAT_EFUSE_BLANK_S                                            15

// Field:    [14] EFUSE_TIMEOUT
//
// Efuse scanning resulted in timeout error.
// 0 : No Timeout error
// 1 : Timeout Error
#define FLASH_STAT_EFUSE_TIMEOUT                                    0x00004000
#define FLASH_STAT_EFUSE_TIMEOUT_BITN                                       14
#define FLASH_STAT_EFUSE_TIMEOUT_M                                  0x00004000
#define FLASH_STAT_EFUSE_TIMEOUT_S                                          14

// Field:    [13] SPRS_BYTE_NOT_OK
//
// Efuse scanning resulted in scan chain Sparse byte error.
// 0 : No Sparse error
// 1 : Sparse Error
#define FLASH_STAT_SPRS_BYTE_NOT_OK                                 0x00002000
#define FLASH_STAT_SPRS_BYTE_NOT_OK_BITN                                    13
#define FLASH_STAT_SPRS_BYTE_NOT_OK_M                               0x00002000
#define FLASH_STAT_SPRS_BYTE_NOT_OK_S                                       13

