espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_flash.h
// Field:     [1] TEST_EN
//
// Internal. Only to be used through TI provided API.
#define FLASH_FTCTL_TEST_EN                                         0x00000002
#define FLASH_FTCTL_TEST_EN_BITN                                             1
#define FLASH_FTCTL_TEST_EN_M                                       0x00000002
#define FLASH_FTCTL_TEST_EN_S                                                1

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE0
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE0
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE0_FWPWRITE0_W                                         32
#define FLASH_FWPWRITE0_FWPWRITE0_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE0_FWPWRITE0_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE1
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE1
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE1_FWPWRITE1_W                                         32
#define FLASH_FWPWRITE1_FWPWRITE1_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE1_FWPWRITE1_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE2
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE2
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE2_FWPWRITE2_W                                         32
#define FLASH_FWPWRITE2_FWPWRITE2_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE2_FWPWRITE2_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE3
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE3
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE3_FWPWRITE3_W                                         32
#define FLASH_FWPWRITE3_FWPWRITE3_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE3_FWPWRITE3_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE4
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE4
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE4_FWPWRITE4_W                                         32
#define FLASH_FWPWRITE4_FWPWRITE4_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE4_FWPWRITE4_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE5
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE5
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE5_FWPWRITE5_W                                         32
#define FLASH_FWPWRITE5_FWPWRITE5_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE5_FWPWRITE5_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE6
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE6
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE6_FWPWRITE6_W                                         32
#define FLASH_FWPWRITE6_FWPWRITE6_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE6_FWPWRITE6_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE7
//
//*****************************************************************************
// Field:  [31:0] FWPWRITE7
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE7_FWPWRITE7_W                                         32
#define FLASH_FWPWRITE7_FWPWRITE7_M                                 0xFFFFFFFF
#define FLASH_FWPWRITE7_FWPWRITE7_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FWPWRITE_ECC
//
//*****************************************************************************
// Field: [31:24] ECCBYTES07_00
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_W                                   8
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_M                          0xFF000000
#define FLASH_FWPWRITE_ECC_ECCBYTES07_00_S                                  24

// Field: [23:16] ECCBYTES15_08
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_W                                   8
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_M                          0x00FF0000
#define FLASH_FWPWRITE_ECC_ECCBYTES15_08_S                                  16

// Field:  [15:8] ECCBYTES23_16
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_W                                   8
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_M                          0x0000FF00
#define FLASH_FWPWRITE_ECC_ECCBYTES23_16_S                                   8

// Field:   [7:0] ECCBYTES31_24
//
// Internal. Only to be used through TI provided API.
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_W                                   8
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_M                          0x000000FF
#define FLASH_FWPWRITE_ECC_ECCBYTES31_24_S                                   0

//*****************************************************************************
//
// Register: FLASH_O_FSWSTAT
//
//*****************************************************************************
// Field:     [0] SAFELV
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSWSTAT_SAFELV                                        0x00000001
#define FLASH_FSWSTAT_SAFELV_BITN                                            0
#define FLASH_FSWSTAT_SAFELV_M                                      0x00000001
#define FLASH_FSWSTAT_SAFELV_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_FSM_GLBCTL
//
//*****************************************************************************
// Field:     [0] CLKSEL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_GLBCTL_CLKSEL                                     0x00000001
#define FLASH_FSM_GLBCTL_CLKSEL_BITN                                         0
#define FLASH_FSM_GLBCTL_CLKSEL_M                                   0x00000001
#define FLASH_FSM_GLBCTL_CLKSEL_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_STATE
//
//*****************************************************************************
// Field:    [11] CTRLENZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_CTRLENZ                                     0x00000800
#define FLASH_FSM_STATE_CTRLENZ_BITN                                        11
#define FLASH_FSM_STATE_CTRLENZ_M                                   0x00000800
#define FLASH_FSM_STATE_CTRLENZ_S                                           11

// Field:    [10] EXECUTEZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_EXECUTEZ                                    0x00000400
#define FLASH_FSM_STATE_EXECUTEZ_BITN                                       10
#define FLASH_FSM_STATE_EXECUTEZ_M                                  0x00000400
#define FLASH_FSM_STATE_EXECUTEZ_S                                          10

// Field:     [8] FSM_ACT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_FSM_ACT                                     0x00000100
#define FLASH_FSM_STATE_FSM_ACT_BITN                                         8
#define FLASH_FSM_STATE_FSM_ACT_M                                   0x00000100
#define FLASH_FSM_STATE_FSM_ACT_S                                            8

// Field:     [7] TIOTP_ACT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_TIOTP_ACT                                   0x00000080
#define FLASH_FSM_STATE_TIOTP_ACT_BITN                                       7
#define FLASH_FSM_STATE_TIOTP_ACT_M                                 0x00000080
#define FLASH_FSM_STATE_TIOTP_ACT_S                                          7

