espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_flash.h
// Field:     [6] OTP_ACT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STATE_OTP_ACT                                     0x00000040
#define FLASH_FSM_STATE_OTP_ACT_BITN                                         6
#define FLASH_FSM_STATE_OTP_ACT_M                                   0x00000040
#define FLASH_FSM_STATE_OTP_ACT_S                                            6

//*****************************************************************************
//
// Register: FLASH_O_FSM_STAT
//
//*****************************************************************************
// Field:     [2] NON_OP
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STAT_NON_OP                                       0x00000004
#define FLASH_FSM_STAT_NON_OP_BITN                                           2
#define FLASH_FSM_STAT_NON_OP_M                                     0x00000004
#define FLASH_FSM_STAT_NON_OP_S                                              2

// Field:     [1] OVR_PUL_CNT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STAT_OVR_PUL_CNT                                  0x00000002
#define FLASH_FSM_STAT_OVR_PUL_CNT_BITN                                      1
#define FLASH_FSM_STAT_OVR_PUL_CNT_M                                0x00000002
#define FLASH_FSM_STAT_OVR_PUL_CNT_S                                         1

// Field:     [0] INV_DAT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_STAT_INV_DAT                                      0x00000001
#define FLASH_FSM_STAT_INV_DAT_BITN                                          0
#define FLASH_FSM_STAT_INV_DAT_M                                    0x00000001
#define FLASH_FSM_STAT_INV_DAT_S                                             0

//*****************************************************************************
//
// Register: FLASH_O_FSM_CMD
//
//*****************************************************************************
// Field:   [5:0] FSMCMD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_CMD_FSMCMD_W                                               6
#define FLASH_FSM_CMD_FSMCMD_M                                      0x0000003F
#define FLASH_FSM_CMD_FSMCMD_S                                               0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_OSU
//
//*****************************************************************************
// Field:  [15:8] PGM_OSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_OSU_PGM_OSU_W                                           8
#define FLASH_FSM_PE_OSU_PGM_OSU_M                                  0x0000FF00
#define FLASH_FSM_PE_OSU_PGM_OSU_S                                           8

// Field:   [7:0] ERA_OSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_OSU_ERA_OSU_W                                           8
#define FLASH_FSM_PE_OSU_ERA_OSU_M                                  0x000000FF
#define FLASH_FSM_PE_OSU_ERA_OSU_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_VSTAT
//
//*****************************************************************************
// Field: [15:12] VSTAT_CNT
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_VSTAT_VSTAT_CNT_W                                          4
#define FLASH_FSM_VSTAT_VSTAT_CNT_M                                 0x0000F000
#define FLASH_FSM_VSTAT_VSTAT_CNT_S                                         12

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_VSU
//
//*****************************************************************************
// Field:  [15:8] PGM_VSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_VSU_PGM_VSU_W                                           8
#define FLASH_FSM_PE_VSU_PGM_VSU_M                                  0x0000FF00
#define FLASH_FSM_PE_VSU_PGM_VSU_S                                           8

// Field:   [7:0] ERA_VSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_VSU_ERA_VSU_W                                           8
#define FLASH_FSM_PE_VSU_ERA_VSU_M                                  0x000000FF
#define FLASH_FSM_PE_VSU_ERA_VSU_S                                           0

//*****************************************************************************
//
// Register: FLASH_O_FSM_CMP_VSU
//
//*****************************************************************************
// Field: [15:12] ADD_EXZ
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_CMP_VSU_ADD_EXZ_W                                          4
#define FLASH_FSM_CMP_VSU_ADD_EXZ_M                                 0x0000F000
#define FLASH_FSM_CMP_VSU_ADD_EXZ_S                                         12

//*****************************************************************************
//
// Register: FLASH_O_FSM_EX_VAL
//
//*****************************************************************************
// Field:  [15:8] REP_VSU
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EX_VAL_REP_VSU_W                                           8
#define FLASH_FSM_EX_VAL_REP_VSU_M                                  0x0000FF00
#define FLASH_FSM_EX_VAL_REP_VSU_S                                           8

// Field:   [7:0] EXE_VALD
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_EX_VAL_EXE_VALD_W                                          8
#define FLASH_FSM_EX_VAL_EXE_VALD_M                                 0x000000FF
#define FLASH_FSM_EX_VAL_EXE_VALD_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FSM_RD_H
//
//*****************************************************************************
// Field:   [7:0] RD_H
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_RD_H_RD_H_W                                                8
#define FLASH_FSM_RD_H_RD_H_M                                       0x000000FF
#define FLASH_FSM_RD_H_RD_H_S                                                0

//*****************************************************************************
//
// Register: FLASH_O_FSM_P_OH
//
//*****************************************************************************
// Field:  [15:8] PGM_OH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_P_OH_PGM_OH_W                                              8
#define FLASH_FSM_P_OH_PGM_OH_M                                     0x0000FF00
#define FLASH_FSM_P_OH_PGM_OH_S                                              8

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_OH
//
//*****************************************************************************
// Field:  [15:0] ERA_OH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_OH_ERA_OH_W                                           16
#define FLASH_FSM_ERA_OH_ERA_OH_M                                   0x0000FFFF
#define FLASH_FSM_ERA_OH_ERA_OH_S                                            0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SAV_PPUL
//
//*****************************************************************************
// Field:  [11:0] SAV_P_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_W                                      12
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_M                              0x00000FFF
#define FLASH_FSM_SAV_PPUL_SAV_P_PUL_S                                       0

//*****************************************************************************
//
// Register: FLASH_O_FSM_PE_VH
//
//*****************************************************************************
// Field:  [15:8] PGM_VH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PE_VH_PGM_VH_W                                             8
#define FLASH_FSM_PE_VH_PGM_VH_M                                    0x0000FF00
#define FLASH_FSM_PE_VH_PGM_VH_S                                             8

//*****************************************************************************
//
// Register: FLASH_O_FSM_PRG_PW
//
//*****************************************************************************
// Field:  [15:0] PROG_PUL_WIDTH
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_W                                   16
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_M                           0x0000FFFF
#define FLASH_FSM_PRG_PW_PROG_PUL_WIDTH_S                                    0

//*****************************************************************************
//
// Register: FLASH_O_FSM_ERA_PW
//
//*****************************************************************************
// Field:  [31:0] FSM_ERA_PW
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_W                                       32
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_M                               0xFFFFFFFF
#define FLASH_FSM_ERA_PW_FSM_ERA_PW_S                                        0

//*****************************************************************************
//
// Register: FLASH_O_FSM_SAV_ERA_PUL
//
//*****************************************************************************
// Field:  [11:0] SAV_ERA_PUL
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_W                                 12
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_M                         0x00000FFF
#define FLASH_FSM_SAV_ERA_PUL_SAV_ERA_PUL_S                                  0

//*****************************************************************************
//
// Register: FLASH_O_FSM_TIMER
//
//*****************************************************************************
// Field:  [31:0] FSM_TIMER
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_TIMER_FSM_TIMER_W                                         32
#define FLASH_FSM_TIMER_FSM_TIMER_M                                 0xFFFFFFFF
#define FLASH_FSM_TIMER_FSM_TIMER_S                                          0

//*****************************************************************************
//
// Register: FLASH_O_FSM_MODE
//
//*****************************************************************************
// Field: [19:18] RDV_SUBMODE
//
// Internal. Only to be used through TI provided API.
#define FLASH_FSM_MODE_RDV_SUBMODE_W                                         2
#define FLASH_FSM_MODE_RDV_SUBMODE_M                                0x000C0000
#define FLASH_FSM_MODE_RDV_SUBMODE_S                                        18

